# Напишите код, который переводит целое число в строку, при том что его можно применить в любой системе счисления.
a = input()
b = int(input())
print(int(a, b))