# Выведите первый и последний элемент списка.

lst = [1, 2, 3, 4, 5]
print(f'{lst[0]}, {lst[-1]}')